#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "aaafa64d20354f1bf151124136f76a33" -> "af237b4366f3bb1c3f44b9d0a5f3097c"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "4df5d7691f52560d5955787679151191" -> "d266697fb1fd8bb95271433724d8d7bc"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "64cc325ec90ea68504f6b50ce4e4bca1" -> "64aa51be42da4ebd0fa4b071db6501f2"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "86bb915513edd14a57fb91b44ae8d00d" -> "2d689dcaa2a0d44e95443648e582d102"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "c341ae1bbffc22274fc31a7ea448ab8a" -> "1ffee48e18306212c963b8af70933601"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "3c6e9c74c7061f747a2897412f75ad5a" -> "a50979f5b9f09b9d66a8d3c235c530ee"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "ffa60d5cb2b07049816975900d2214c4" -> "40eae47be5c5e6cb69f7028a892f07f3"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "aaa32839d3b34c6ed5452595e1168ea8" -> "599aede0ee6973c350dfa2ba2ada3da7"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "e235172dd15cc7dd312aded7ba4acf21" -> "6c84d0e8933de5a8699667e8f2d6adde"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "5dcac26e20635e5f5b08aa6fa74c64cc" -> "51e5c03d213b3734340c83f1a2f095a0"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "6d05ece71b1b083336dbd8d607bdffa0" -> "1da5699ec401633fe55f538a8abeafca"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "c00b7077af1fb38780c4395c6d2dd4be" -> "e306e501b88754079d6a58d9caf0accf"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "4cc374f6e5a8de89efaea95623f3bcb8" -> "fb2b2a98cdce48f26c78c0f58b0f0f1e"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "475ad51a40f882cc715671a05d8c1853" -> "1bdd5caa71a437ba5253bc5be6441255"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "a933cb2b456fa38064aca50158484aa5" -> "94bd95a47ccd95e81e9ca23498cbcfc0"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "072df4221ffbc23687152072f2e09279" -> "d3faacc7464ac82c4ec6c40031c85d15"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "9d9f43393edf63f563c65b968f0a2493" -> "d9d327a9206abe58d121707076b8405e"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "1f123b0fd7f72c50f6b76afd0ece8375" -> "590a852025120bdcba524ecbbb07ee12"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "4c292f23bc02070b33992596f5fb1212" -> "a418d1a899c14ae12afdbb1a8654c720"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "8fbb1ec469b1fbb1edfb595bc18758e2" -> "10729588f1cd09a2e332478b2b0adb5c"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "f77c0398f13d80e2f137e2c876ece89a" -> "302435aff971b5f94dd3c1ae1a393d82"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "88a8d738041fcd274984ad230e0a863b" -> "90546a0d08c4821982e9f95c895894b3"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "6a9da0c1b445f9a7ff3e8720919779a9" -> "e9d976d6c7cc5ec10889593fb95e75c5"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "cbd9736418ca7a78ea4077cf089e1fb2" -> "e37d1d8470b5061d2fb0798c0799c0e5"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "040ae9d8f398d75bdf40a56b59309f64" -> "8527e9e48def0b92d19f695f6e6cf588"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "792f2c860d44635bd57fec3e4291e91c" -> "6fd4407cca4fcbe1e396d74cee3d9733"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "39dc456180341cfcc1a1b066b545e4e4" -> "0335ccd0a88fb0f38de24313031e8622"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "6e00cf7d81217d3397f1fdcd5d2be01e" -> "1710928a4e2a1acb2d52f2c6ef234b5e"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "33db68fb40e1aa9029b96862491da873" -> "81ee6d078f5559f57b41f20e76eb9a8c"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "fd061333ad6d2e461cda907bee49c220" -> "ff6b938a59fe573c2a0a873026a1f01d"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "bfd8c737950516e1ddd28e1135c45565" -> "b6ec3315189ff95a4e0450280347f986"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f7cd4d4c17d95f6c474584bbf3a9cf35" -> "4a5d280820487a7e353c2460b6a8d411"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "474cf58c84c75e89f1137753d8234fc0" -> "b1f4a590c6099ac3e111359bfbf9204f"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0bf87652b964b88327162abfb2439e70" -> "20e7629989d944fb64892c2be2b4fae5"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "f7b8c25db26188128d991076c12dfde4" -> "25f7e36e99be6aa0e72ba464d6513cf5"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "5aeeecf18cdafd21dd0a0904a8266c37" -> "659eb2ceb085e72cf532261041e43fbe"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "ab19312ad691501a1ea42c977f891b53" -> "dea488c0fe6161fa0eb8e92949d8a1f1"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "4d9c93dd3dca13a28707483429e987a1" -> "ff3e55bb79d48ce4abd8426403c57497"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "cd1a93977d7edf03a63d39c93f641ddf" -> "034445c56e2ebcbda48e6f07821b1f8f"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "0dfefd94f0fc486f2dd3155cfaee19dc" -> "af600e7a2108cb987abaf77f19fbc356"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ce975857d3991c83ba090e543c582cbc" -> "3c80a8467fc2bc02557faa3fde70353e"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "8ad1163529d160dd762b100389087af1" -> "d3891c1f980c34d691149642bd099cf3"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "a9818148d2fa3478936d5a2ac951aa58" -> "e2c6c7764d580af8a85f65ccd366081e"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "ed026282f7638c4fb0da9964a8b4690b" -> "ac724072d1d1e20500071df013c30abe"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4a12dff2f92a4c2591b073f3b4f9ba0d" -> "85b6099b6f8f28cce53572fd660e8e40"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "dMJ2RYetyQOoHUnk7C1mb/Ycpc2FhXeegai4TyQDQyg=" -> "7Hb1c8oYch8Q2aztc75F2BL7iUCWLg9XeFmA7UIIC4A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "8Vflc/oDO1NaiARlJ79MCD+NZMpnm6RW1kte4kf+H7Y=" -> "Z9Lex/P8SQ9mfDqcDnU2RG7GJp79hxN/OkP0e8JSTR4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pihLiUwQJu6AapPyWgxKNfK46ikiqY5+9WK5XEH8XX4=" -> "5fg4hwV6BHkkuY56MOdnV6XDHIZ+4yiF9nlHDm/o6Rw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "eZJF0NwOtbAvM7GM6KMWW7z9OYesOkNu4mKoh9YYxzg=" -> "vtqWI4ARTGDsrNqZxL2zZLaoUVN6UKoQjaBxe5bGh0A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "ifa6ecCsSSYmcPxGFQZaJwApiEMPJwLEJBuEcWJj1Bs=" -> "RLXFvpTiwQWdlpB5474xf9NcQtPcMDsKLaS/X38ljFU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "AiMC9UqpZAzTLmA/Gef9JslDtV/SePhz4rw5bos9yno=" -> "P4P5uYBIrwmIhjKv75Z+K0nByHGGiknk5+Ajk3Q+Oi8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "hrPx9aVzHTKz9OJA4giT1iviLi3M5mxx4YD2YIxzkXg=" -> "fwZ2PH6jlwgsiWMvEFTmemMd8v6ijQ1dYk3l8rYBSLI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "yYpNueJAJ7l2Ni/a24CVJMwtTiwTrqdyh6rMpIUbZYk=" -> "MdgyDw3iREHA2cTyYcL2vN1rDKeKD1ffHb3AQ+vnksE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "uOZ2MS/hPze5HVwEy+FbdJW5okfwP0e6GtDDgu3ClCQ=" -> "16mLCvnDJyeZz/kDYhfQuu55SPle507DyssxMJXJ4Js="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "LoDD41PuGrhcx3LgRnB872bKkehuRJsoLBP3wSHjcCQ=" -> "vl2NqAin2/p5FlXH9Dn78XcVhtqCXCRbtxrYhScs0Fk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "qtm5VrfPzAumb1aw2oMaSyQwLOIJqo+Tf8UJows4d1o=" -> "SEiqvd6GMe1QOmnZGLlk3mPiSbdu3rRqWpuHdFnQXC8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "S7mMfi6GGx9IJpBMAY4pyUDDqTQulRlJ6iPh8mitu+4=" -> "FJ+e1/ylGdB1Nx7vfKKNiiMWbtMz2a4ZXcHnldocnGA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "uigGW06hppx1vLtQxPYul/1c7Vm265YGax1V6fheCKI=" -> "5XcOOOQE6Roq7sksdzONA3tL/cl7ifVdh6mt4YWkZ2E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "JPUQRHCHIqTevZW014IFiwqrKNoSWCQFCJaT/jCgSsk=" -> "uuYWgxJF4DflF8LkEEmFuMjgEo3X09eeTUzSU0MV/+U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Cn/ClkTNO4cvcJ1ATyhiJa6GsDrg5CPsCrAvu1Whiyc=" -> "Th1M44mmjczo6CUXmKHWkfuFGvwbe981/hcJjFmNnD0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "sWvfcdb+0PGXLOJaAsvY7dOosGaIAIslv7lbjyetZGI=" -> "fG4mlIZLmTVderS6uriIHEwM3llfG8iH/KVeBdegWic="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "jVKBGrY9hRoK/I81vCNPnU6Bp8Cu4kjO5g94yXE6pyQ=" -> "zIpwGkn4j1zMau2Jjm2n/Po3Xje2rGnn5qVQn9v9eGM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "SpQ/P45HZnwfaTaSfW0DNQLMpU+jeS2KVfiO4iWc0qg=" -> "fBMSgCVZMHsuTcILv0Mai3JrfIJwqSpK8/llMXPF4Q0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "K4CKRPND3HkYc+VAxoMw10LTt/JadOIlt6n1MP0Enkc=" -> "s07EJ7cDyEfshud3g10Vl4apIJAPzckHYuTGkcWb7cw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-20T13:41:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "jm87YVgeseLWJCEHuz240OhiBxDYP6VHxrLLRwG0MwQ=" -> "Ray8yZnyBJre30YWiZW1bLAjVhRIuJVBS0sdsMjqj28="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mk/6A4ma0TB6i+uAYmE6J6AOozGoadGvXnDSVYfJaJ0=" -> "8yVJLxjajioGDmOWORjhdzXdsxjsQ9bAm2QNFwHMMdA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "EvAvj2UeUZy9E2s9RZcvIu/3QbXng/It33Arh6VrYtc=" -> "WS0VJTZ7v2X+QDTzMgC2YhLcvlNFSenUUpKS0sV14uA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "FUxZsh/66ln0GO8eRoywNiReMtBunldgcgyLsoX1P6k=" -> "FAGjtGuiQzMXcst4peosEyYs4Nn1L010g1aOEsLj9ZM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zm40WvcsB9TNc/n/lLSNIzuONtiUMmDPcTUPEMdmnIk=" -> "CTpcFN8mQ0ne3Ubtv36/rmFD+0d0xFGhj/3/WdxhjGA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "YFRHKuAI8DwuegERcWoPyFt5hvOkCpmoarHeGqE4Rrg=" -> "+Fx9GXbIkrNjD/UvsKxUSPdBtiuk7mFhvFSHqE3q/M0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-21T19:16:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "VOIzUVm8Gq81ReLxapGHzGQ5x1ctS6tpMiDhq/7I1FM=" -> "B5P5xbUA0+3cUI5tF85G2LgNtzrziZJUS56AApZ2TBo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ez+qbKyzvqpGbmFUsAA7uQe9AYt49tYhNK2cZl5uuB4=" -> "XLIJvOgQowsBq1yIX+6fpSgAu/UyLwv7cOHePT7QYvw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "zo2UWO11JBGnwI+S/V00/bq2zKztDAbL6s2drtLe6qo=" -> "lF+4x00e3nBIygOozkwW45TESjN1zWGU7WBIyDjxA4Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "CpN7kXf5BUpDhjbkhsq7h7C3MBzf6QH6tYkjgmGLRB4=" -> "269LDz1izROqGL4P8zRL65cwl1ABKiL3xG4WCxrbwNM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "TayHhkgRq08oBb8vvpKuLWrDhXCys7lMn9WX1DwhK0I=" -> "ggQvo9CY+LlQeDixEr5MjfZM1gvKt/q+Q7VHhUUXbzg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "5N6rh+9in1mbdi3B54s/pLEbkFYy6HaX5epBIC4QYxI=" -> "F5yIaYL5woJ/Jv2H2WZloXqXYA8vPltK1KdLnEBxPgI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "L84tKCG1qsTT7lE/qaD+GXHvZvX8lYZy1/Kl/WeVnpI=" -> "hzZF0o3fbF+qOQIGt2Yacd6zblHyeiXPFkSqTCfShVQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "icQ4SD6Z0Rzv+Ao1v0YatTXbtWGAKir649AUhOW6rJs=" -> "V0kizmb4U5t3T6jEwmAFYBlv2rNDVs5dZfXCyyZ9kY8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "XDV7p7EFXK7uUyWKrqqC7yRCGY2Wz37PHw5u/rgTTGQ=" -> "a70Jzvlc95vMZUIVTCcmQt74APrzUFyUSku50t8Wr6Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "3M1Cj9yZ81J8DyA1hLr4W9tGOTpDZ1bYAp/jtrJ8vqc=" -> "r9cSy3A2rXPyzPbidzAIPiRnlqcpVWF5TpsadDG2Nq4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "WTQ3fdHgGUAUsf/cJCk5sZBpsxTXruVgqitFqUqe44I=" -> "6JXjtdPacEGomUJV10aQMal68uOo/BgtsamvDXQv+wk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "hEd7mdbyJzq9Q4TrdZkvTjd6c/9LE5NNqvVJPwWA480=" -> "F1WozuA3RgYY7Yjxna4g6DOZOvdc28fPShc3ZYgqFMY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "B5dRypOnUx0Kw+aRB1XcwvyBA+fs3cBlSC66Sdp4+wA=" -> "zMj51kUh59UbPH4Wc1hN8vnaeuxVjqbBuvZl8aoMotQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "ISTmuW3opF9ke6bTCLv3qInFZgiMI0TXtYyLa7H7xu0=" -> "LjQRAWj6r6rSKXjGUQk8XKeSQNevSO0czWVspEdtWQU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "+GdiKRF6JkyixBnptQEFbdEwQ1aARI2YWWZOoG7mc/g=" -> "hSB8yyxi34/ui3SyDMhdY/7tnOY2CBQTD2PuZeEWLD8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "2pBtKLBB4TJm2OYYC6MFDTiXTl//uP5wN3uwfbL3MSs=" -> "Yqu7Ch0wGihliLmRmGgqGoolu5lKUdoy3yFyJPTaHDA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ALCqK5jK2Ms+4Cq/ZaGIM3qkYOUpXF9VFW2Lra2zKoQ=" -> "sA2xEsA6aC3foc0nP/5fgrWTiKj3jccqH5ezZsYsxGk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "g9CBtcCh+khAXW/zd6pEp1Bok0sqX1YFYbvRvdT1PHE=" -> "ffYtSJbCZDOcrqcYAPagCn1E6R1gmwxP+HcD+iaMfhM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "LDA67S1nSq2oZgjLN4yI+RszXHWfX6oTN47dst398O8=" -> "5vm/uno11cXSccI2z90leom2tsLuGjgJZA7h6NY5uyE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-15T20:57:31Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "y2uxop" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-15T20:57:30Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-15T20:57:29Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*